schreibfaul1/ESP32-MiniWebRadio/src/settings.h
#ifdef SPI_DISPLAY
    #if (SPI_DISPLAY == 1)
        #define TFT_FREQUENCY 40000000 // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
        #define TFT_CONTROLLER       0 // (0)SPI-ILI9341[320x240]
        #define TFT_ROTATION         0 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        1 // (1)XPT2046 3.5" or 4.0
        #define TP_ROTATION          2 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0 // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0 // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    0 // (0) off (1) on
        #define BRIGHTNESS_INVERSION 0 // (0) off (1) on, bg-led
    #endif
    #if (SPI_DISPLAY == 2)
        #define TFT_FREQUENCY 40000000 // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
        #define TFT_CONTROLLER       5 // (5)SPI-ILI9488 or ST7796[480x320]
        #define TFT_ROTATION         0 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        1 // (1)XPT2046 3.5" or 4.0
        #define TP_ROTATION          2 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0 // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0 // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    0 // (0) off (1) on
        #define BRIGHTNESS_INVERSION 0 // (0) off (1) on, bg-led
    #endif
    #if (SPI_DISPLAY == 3)
        #define TFT_FREQUENCY 40000000 // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
        #define TFT_CONTROLLER       5 // (5)SPI-ILI9488 or ST7796[480x320]
        #define TFT_ROTATION         0 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        8 // FT6x63
        #define TP_ROTATION          1 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0 // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0 // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    1 // (0) off (1) on
        #define BRIGHTNESS_INVERSION 0 // (0) off (1) on, bg-led
    #endif
    #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN             4  // IR Receiver (if available)
        #define TFT_MOSI           18 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            17 // TFT and TP (FSPI)
        #define I2S_DOUT           9
        #define I2S_BCLK           3
        #define I2S_LRC            1
        #define I2S_MCLK           0
        #define BT_EMITTER_RX      45 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    20 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            41 // I2C, dala line for capacitive touchpadand and light sensor (-1 if not available)
        #define I2C_SCL            42 // I2C, clock line for capacitive touchpadand and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif                            // CONFIG_IDF_TARGET_ESP32S3

    #if CONFIG_IDF_TARGET_ESP32P4
        #define TFT_CS             26
        #define TFT_DC             3
        #define TFT_BL             4 // at -1 the brightness menu is not displayed
        #define TP_IRQ             5
        #define TP_CS              2
        #define SD_MMC_D0          39
        #define SD_MMC_D1          40
        #define SD_MMC_D2          41
        #define SD_MMC_D3          42
        #define SD_MMC_CLK         43
        #define SD_MMC_CMD         44
        #define IR_PIN             32 // IR Receiver (if available)
        #define TFT_MOSI           20 // TFT and TP (FSPI)
        #define TFT_MISO           21 // TFT and TP (FSPI)
        #define TFT_SCK            22 // TFT and TP (FSPI)
        #define I2S_DOUT           23
        #define I2S_BCLK           24
        #define I2S_LRC            25
        #define I2S_MCLK           -1
        #define BT_EMITTER_RX      27 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    29 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 30 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            7  // I2C, dala line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            8  // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        33 // onboard amplifier (-1 if not available)
    // free pins 46, 47, 48, 49, 50, 51, 52
    #endif // CONFIG_IDF_TARGET_ESP32P4
#endif

// // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 SUNTON   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_8048S070
        #define TFT_CONTROLLER       7 // (7)RGB[800x480]
        #define TFT_ROTATION         2 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        7 // (7)GT911
        #define TP_ROTATION          1 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0 // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0 // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    0 // (0) off (1) on
        #define BRIGHTNESS_INVERSION 0 // (0) off (1) on, bg-led

