schreibfaul1/ESP32-MiniWebRadio/src/settings.h
const Pins RGB_PINS = { // SUNTON 7"
    .b0 = 15, .b1 = 7, .b2 = 6, .b3 = 5, .b4 = 4, .g0 = 9, .g1 = 46, .g2 = 3, .g3 = 8, .g4 = 16, .g5 = 1, .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 42, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 8600000, .hsync_pulse_width = 40, .hsync_back_porch = 16, .hsync_front_porch = 10, .vsync_pulse_width = 20, .vsync_back_porch = 10, .vsync_front_porch = 22};

        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2S_DOUT           17
        #define I2S_BCLK           0
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define I2C_SDA            19 // I2C, data line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            20 // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_S3_Touch_LCD7
        #define TFT_CONTROLLER       7 // (7)RGB[800x480]
        #define TFT_ROTATION         2 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        7 // (7)GT911
        #define TP_ROTATION          1 // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0 // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0 // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    0 // (0) off (1) on
        #define BRIGHTNESS_INVERSION 0 // (0) off (1) on, bg-led
const Pins RGB_PINS = { // WAVESHARE
    .b0 = 14, .b1 = 38, .b2 = 18, .b3 = 17, .b4 = 10, .g0 = 39, .g1 = 0, .g2 = 45, .g3 = 48, .g4 = 47, .g5 = 21, .r0 = 1, .r1 = 2, .r2 = 42, .r3 = 41, .r4 = 40, .hsync = 46, .vsync = 3, .de = 5, .pclk = 7, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 13000000, .hsync_pulse_width = 1, .hsync_back_porch = 1, .hsync_front_porch = 1, .vsync_pulse_width = 4, .vsync_back_porch = 4, .vsync_front_porch = 4};

        #define TP_IRQ -1

        #define SD_MMC_CMD 11
        #define SD_MMC_CLK 12
        #define SD_MMC_D0  13

        #define I2S_DOUT 19
        #define I2S_BCLK 20
        #define I2S_LRC  15
        #define I2S_MCLK -1 // important, don't change!

        #define IR_PIN             6  // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins

        #define TFT_BL      -1 // same as RGB_PINS.bl
        #define AMP_ENABLED -1 // control pin for extenal amplifier (if available)

        #define I2C_SDA 8 // I2C dala line for capacitive touchpad  (-1 if not used)
        #define I2C_SCL 9 // I2C clock line for capacitive touchpad (-1 if not used)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DSI-DISPLAY [1024x600] ESP32-P4 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef ESP32_P4_WIFI6_TOUCH_LCD7_7B
        #define TFT_CONTROLLER       8   // (8)DSI-EK97007[1024x600]
        #define TFT_ROTATION         0   // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_CONTROLLER        7   // (7)GT911
        #define TP_ROTATION          1   // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
        #define TP_H_MIRROR          0   // (0) default, (1) mirror left <-> right
        #define TP_V_MIRROR          0   // (0) default, (1) mirror up <-> down
        #define DISPLAY_INVERSION    0   // (0) off (1) on
        #define BRIGHTNESS_INVERSION 1   // (0) off (1) on, bg-led

const Timing DSI_TIMING = {.h_res = 1024, .v_res = 600, .pixel_clock_mhz = 52, .hsync_pulse_width = 10, .hsync_back_porch = 160, .hsync_front_porch = 160, .vsync_pulse_width = 1, .vsync_back_porch = 23, .vsync_front_porch = 22, .lane_bit_rate_mbps = 900};

        #define TP_IRQ -1

        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S ext. DAC
        #define I2S_DOUT 2
        #define I2S_BCLK 3
        #define I2S_LRC  4
        #define I2S_MCLK -1

    // I2S onboard DAC ES8311
    // #define I2S_DOUT  9 // ES8311 DSDIN
    // #define I2S_BCLK 12 // ES8311 SCLK
    // #define I2S_LRC  10 // ES8311 LRCK
    // #define I2S_MCLK 13 // ES8311 MCLK
    // #define I2S_DIN  11 // ES8311 DOUT (microphone input)

        #define IR_PIN             5 // IR Receiver (if available)
        #define BT_EMITTER_RX      28
        #define BT_EMITTER_TX      29
        #define BT_EMITTER_LINK    30
        #define BT_EMITTER_MODE    31
        #define BT_EMITTER_CONNECT 34

        #define LCD_RESET   33
        #define TFT_BL      32 //
        #define AMP_ENABLED 53 // control pin for extenal amplifier

